In [1]:
import numpy as np
import pandas as pd
labels="A B C".split()
my_data=list(map(int,"10 20 30".split()))
arr=np.array(my_data)
dictionary={'A':10,'B':20,'C':30}
print("Labels:",labels,"\nMy_Data:",my_data,"\nDictionary:",dictionary)

Labels: ['A', 'B', 'C']
My_Data: [10, 20, 30]
Dictionary: {'A': 10, 'B': 20, 'C': 30}

In [2]:
ser1=pd.Series(data=my_data,index=labels)
ser1

A    10
B    20
C    30
dtype: int64

In [3]:
#Holding Numerical Data
ser1=pd.Series(arr)
ser1

0    10
1    20
2    30
dtype: int32

In [4]:
#Holding Text data
ser1=pd.Series(labels)
ser1

0    A
1    B
2    C
dtype: object

In [5]:
ser1=pd.Series(data=dictionary)
ser1

A    10
B    20
C    30
dtype: int64

In [9]:
w=ser1.reset_index(drop=False)
w

  index   0
0     A  10
1     B  20
2     C  30

In [10]:
type(w)

pandas.core.frame.DataFrame

In [15]:
s1=pd.Series([1,2,3,4,5],['A','B','C','D','E'])
s2=pd.Series([1,2,3,4,5],['A','B','F','D','C'])

In [16]:
s1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [17]:
#Calling by index name/object
s1['A']

1

In [18]:
#Calling by index no.
s1[0]

1

In [19]:
s1+s2

A    2.0
B    4.0
C    8.0
D    8.0
E    NaN
F    NaN
dtype: float64

In [20]:
s1=pd.Series([10,20,30,40],"A B C D".split())
s2=pd.Series([10,20,30,40],"A B E D".split())
s1+s2

A    20.0
B    40.0
C     NaN
D    80.0
E     NaN
dtype: float64

In [21]:
np.exp(s1)+np.log10(s2)

A    2.202747e+04
B    4.851652e+08
C             NaN
D    2.353853e+17
E             NaN
dtype: float64

np.random.seed

In [22]:
from numpy.random import randn 
np.random.seed(989706711)
matrix_data=randn(5,4)
labels="A B C D E".split()
headings="W X Y Z".split()
df=pd.DataFrame(data=matrix_data,index=labels,columns=headings)
df

          W         X         Y         Z
A  0.916794 -0.524092  1.108713  0.320007
B -0.101453  0.211833  0.472790  0.254435
C  1.312422  1.144607  0.236723  0.234795
D  0.505711  0.031879  2.715443  0.104704
E  0.558362 -0.853106 -0.209756  1.079179

In [23]:
df['W']

A    0.916794
B   -0.101453
C    1.312422
D    0.505711
E    0.558362
Name: W, dtype: float64

In [24]:
df[['W' , 'Y']]

          W         Y
A  0.916794  1.108713
B -0.101453  0.472790
C  1.312422  0.236723
D  0.505711  2.715443
E  0.558362 -0.209756

In [25]:
df.loc[['B','D'],['W','X']]

          W         X
B -0.101453  0.211833
D  0.505711  0.031879

In [26]:
df.loc[['B','D'],['W']]

          W
B -0.101453
D  0.505711

In [27]:
df.loc[['B','D']]

          W         X         Y         Z
B -0.101453  0.211833  0.472790  0.254435
D  0.505711  0.031879  2.715443  0.104704

In [28]:
df>0

       W      X      Y     Z
A   True  False   True  True
B  False   True   True  True
C   True   True   True  True
D   True   True   True  True
E   True  False  False  True

In [29]:
df[df>0]

          W         X         Y         Z
A  0.916794       NaN  1.108713  0.320007
B       NaN  0.211833  0.472790  0.254435
C  1.312422  1.144607  0.236723  0.234795
D  0.505711  0.031879  2.715443  0.104704
E  0.558362       NaN       NaN  1.079179

In [30]:
df[df.loc['A B C'.split()]>0]

          W         X         Y         Z
A  0.916794       NaN  1.108713  0.320007
B       NaN  0.211833  0.472790  0.254435
C  1.312422  1.144607  0.236723  0.234795
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

In [50]:
df.loc[['A','B']]>0

       W      X     Y     Z
A   True  False  True  True
B  False   True  True  True

In [52]:
matrix_data=np.matrix("22,66,140;42,70,148;30,62,125;35,68,160;25,62,152")
labels="A B C D E".split()
heading="AGE HEIGHT WEIGHT".split()

In [53]:
df=pd.DataFrame(data=matrix_data,index=labels,columns=heading)

In [54]:
df

   AGE  HEIGHT  WEIGHT
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [55]:
df[['AGE','WEIGHT']]

   AGE  WEIGHT
A   22     140
B   42     148
C   30     125
D   35     160
E   25     152

In [56]:
df.loc[['A','B','C'],['AGE','HEIGHT']]

   AGE  HEIGHT
A   22      66
B   42      70
C   30      62

In [58]:
df.loc[['A','B','C'],['HEIGHT']]

   HEIGHT
A      66
B      70
C      62

In [61]:
booldf=df['WEIGHT']<155
df[booldf]

   AGE  HEIGHT  WEIGHT
A   22      66     140
B   42      70     148
C   30      62     125
E   25      62     152

In [62]:
booldf2=df['HEIGHT']<70

In [63]:
df[booldf & booldf2]

   AGE  HEIGHT  WEIGHT
A   22      66     140
C   30      62     125
E   25      62     152

In [64]:
df[booldf & booldf2][["AGE","HEIGHT"]]

   AGE  HEIGHT
A   22      66
C   30      62
E   25      62

In [65]:
df.reset_index(drop=True,inplace=True)

In [66]:
df

   AGE  HEIGHT  WEIGHT
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [67]:
df["PROFESSION"]="DOCTOR TEACHER POLICE NURSE EMPLOYER".split()

In [68]:
df.set_index('PROFESSION')

            AGE  HEIGHT  WEIGHT
PROFESSION
DOCTOR       22      66     140
TEACHER      42      70     148
POLICE       30      62     125
NURSE        35      68     160
EMPLOYER     25      62     152

In [69]:
df

   AGE  HEIGHT  WEIGHT PROFESSION
0   22      66     140     DOCTOR
1   42      70     148    TEACHER
2   30      62     125     POLICE
3   35      68     160      NURSE
4   25      62     152   EMPLOYER